app/controllers/groups_controller.rb

INSERT INTO "groups" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Amina"], ["user_id", 1], ["created_at", "2022-08-04 22:35:41.418185"], ["updated_at", "2022-08-04 22:35:41.418185"]]
---
  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save

UPDATE "groups" SET "name" = $1, "updated_at" = $2 WHERE "groups"."id" = $3  [["name", "gii"], ["updated_at", "2022-08-05 18:37:27.276618"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @group.update(group_params)

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 1]]
---
  def destroy
    @group = Group.find(params[:id])
    @group.delete