app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."group_id" = $1  [["group_id", 39]]
---
  def index
    set_group
    @transactions = Transaction.where(group_id: params[:group_id])

INSERT INTO "transactions" ("name", "amount", "user_id", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "nnn"], ["amount", "9.0"], ["user_id", nil], ["group_id", 39], ["created_at", "2022-08-06 02:09:58.115545"], ["updated_at", "2022-08-06 02:09:58.115545"]]
---
  def create
    @transaction = Transaction.new(transaction_params)
    @transaction.user_id = current_user.id
    @transaction.group_id = @group.id

    respond_to do |format|
      if @transaction.save

DELETE FROM "transactions" WHERE "transactions"."id" = $1  [["id", 10]]
---
  def destroy
    set_group
    @transaction.destroy

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_group
    @group = Group.find(params[:group_id])